# Pandas Tuts 2

In [1]:
import pandas as pd

In [3]:
# pd.read_csv('wheather_data_cvs.xlsx', 'sheet1')

In [5]:
# df = pd.read_excel('wheather_data_cvs.csv')

In [25]:
#Read_CSV => Skiprow=1 to skip the first row
# - nrows=3 - shows 3 rows only
#Cleaning the data => na_values=['not available', 'n.a.',-1] it will replaced with NaN
df = pd.read_csv('D:\\4. Programming, AI, ML\\04 Machine Learning\\Numpy and Pandas\\stock_data.csv', skiprows=1, na_values=['not available','n.a.'] ) #header=1
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [26]:
#We can supply dictionary
#Data Munging & Data Wrangling
#Cleaning the data => na_values={'not available', 'n.a.',-1} it will replaced with NaN
df = pd.read_csv('D:\\4. Programming, AI, ML\\04 Machine Learning\\Numpy and Pandas\\stock_data.csv', skiprows=1, na_values={
    'eps': ['not available','n.a.'],
    'revenue': ['not available','n.a.',-1],
    'people': ['not available','n.a.']
    
    }) 
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [31]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [32]:
df.to_csv('newfile.csv', columns=['tickers', 'eps'])

In [19]:
#Read_CSV => Header=1 & names[] to write name 
df2 = pd.read_csv('D:\\4. Programming, AI, ML\\04 Machine Learning\\Numpy and Pandas\\stock_data_without_title.csv', header=None, names=['tickers', 'eps', 'revenue', 'price', 'people']) #header=1
df2

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# Read Excel File (.xlsx)

In [42]:
def convert_people_cell(cell):
    if cell == 'n.a.':
        return 'Sam Walton'
    return cell

df3 = pd.read_excel('D:\\4. Programming, AI, ML\\04 Machine Learning\\Numpy and Pandas\\stock_data.xlsx', header=1, converters={
    'people':convert_people_cell
})

df3

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     Sam Walton
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# Write Excel File (.xlsx)

In [52]:
df3.to_excel('newdataexsss.xlsx', sheet_name='stocks', startrow=1, startcol=2) #header=1